FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_IAR_Keil/libchip_samv7/include/samv7/instance/instance_usbhs.h
    #define REG_USBHS_HSTICR            ( *( __O uint32_t * ) 0x40038408U )  /**< \brief (USBHS) Host Global Interrupt Clear Register */
    #define REG_USBHS_HSTIFR            ( *( __O uint32_t * ) 0x4003840CU )  /**< \brief (USBHS) Host Global Interrupt Set Register */
    #define REG_USBHS_HSTIMR            ( *( __I uint32_t * ) 0x40038410U )  /**< \brief (USBHS) Host Global Interrupt Mask Register */
    #define REG_USBHS_HSTIDR            ( *( __O uint32_t * ) 0x40038414U )  /**< \brief (USBHS) Host Global Interrupt Disable Register */
    #define REG_USBHS_HSTIER            ( *( __O uint32_t * ) 0x40038418U )  /**< \brief (USBHS) Host Global Interrupt Enable Register */
    #define REG_USBHS_HSTPIP            ( *( __IO uint32_t * ) 0x4003841CU ) /**< \brief (USBHS) Host Pipe Register */
    #define REG_USBHS_HSTFNUM           ( *( __IO uint32_t * ) 0x40038420U ) /**< \brief (USBHS) Host Frame Number Register */
    #define REG_USBHS_HSTADDR1          ( *( __IO uint32_t * ) 0x40038424U ) /**< \brief (USBHS) Host Address 1 Register */
    #define REG_USBHS_HSTADDR2          ( *( __IO uint32_t * ) 0x40038428U ) /**< \brief (USBHS) Host Address 2 Register */
    #define REG_USBHS_HSTADDR3          ( *( __IO uint32_t * ) 0x4003842CU ) /**< \brief (USBHS) Host Address 3 Register */
    #define REG_USBHS_HSTPIPCFG         ( *( __IO uint32_t * ) 0x40038500U ) /**< \brief (USBHS) Host Pipe Configuration Register (n = 0) */
    #define REG_USBHS_HSTPIPISR         ( *( __I uint32_t * ) 0x40038530U )  /**< \brief (USBHS) Host Pipe Status Register (n = 0) */
    #define REG_USBHS_HSTPIPICR         ( *( __O uint32_t * ) 0x40038560U )  /**< \brief (USBHS) Host Pipe Clear Register (n = 0) */
    #define REG_USBHS_HSTPIPIFR         ( *( __O uint32_t * ) 0x40038590U )  /**< \brief (USBHS) Host Pipe Set Register (n = 0) */
    #define REG_USBHS_HSTPIPIMR         ( *( __I uint32_t * ) 0x400385C0U )  /**< \brief (USBHS) Host Pipe Mask Register (n = 0) */
    #define REG_USBHS_HSTPIPIER         ( *( __O uint32_t * ) 0x400385F0U )  /**< \brief (USBHS) Host Pipe Enable Register (n = 0) */
    #define REG_USBHS_HSTPIPIDR         ( *( __O uint32_t * ) 0x40038620U )  /**< \brief (USBHS) Host Pipe Disable Register (n = 0) */
    #define REG_USBHS_HSTPIPINRQ        ( *( __IO uint32_t * ) 0x40038650U ) /**< \brief (USBHS) Host Pipe IN Request Register (n = 0) */
    #define REG_USBHS_HSTPIPERR         ( *( __IO uint32_t * ) 0x40038680U ) /**< \brief (USBHS) Host Pipe Error Register (n = 0) */
    #define REG_USBHS_HSTDMANXTDSC1     ( *( __IO uint32_t * ) 0x40038710U ) /**< \brief (USBHS) Host DMA Channel Next Descriptor Address Register (n = 1) */
    #define REG_USBHS_HSTDMAADDRESS1    ( *( __IO uint32_t * ) 0x40038714U ) /**< \brief (USBHS) Host DMA Channel Address Register (n = 1) */
    #define REG_USBHS_HSTDMACONTROL1    ( *( __IO uint32_t * ) 0x40038718U ) /**< \brief (USBHS) Host DMA Channel Control Register (n = 1) */
    #define REG_USBHS_HSTDMASTATUS1     ( *( __IO uint32_t * ) 0x4003871CU ) /**< \brief (USBHS) Host DMA Channel Status Register (n = 1) */
    #define REG_USBHS_HSTDMANXTDSC2     ( *( __IO uint32_t * ) 0x40038720U ) /**< \brief (USBHS) Host DMA Channel Next Descriptor Address Register (n = 2) */
    #define REG_USBHS_HSTDMAADDRESS2    ( *( __IO uint32_t * ) 0x40038724U ) /**< \brief (USBHS) Host DMA Channel Address Register (n = 2) */
    #define REG_USBHS_HSTDMACONTROL2    ( *( __IO uint32_t * ) 0x40038728U ) /**< \brief (USBHS) Host DMA Channel Control Register (n = 2) */
    #define REG_USBHS_HSTDMASTATUS2     ( *( __IO uint32_t * ) 0x4003872CU ) /**< \brief (USBHS) Host DMA Channel Status Register (n = 2) */
    #define REG_USBHS_HSTDMANXTDSC3     ( *( __IO uint32_t * ) 0x40038730U ) /**< \brief (USBHS) Host DMA Channel Next Descriptor Address Register (n = 3) */
    #define REG_USBHS_HSTDMAADDRESS3    ( *( __IO uint32_t * ) 0x40038734U ) /**< \brief (USBHS) Host DMA Channel Address Register (n = 3) */
    #define REG_USBHS_HSTDMACONTROL3    ( *( __IO uint32_t * ) 0x40038738U ) /**< \brief (USBHS) Host DMA Channel Control Register (n = 3) */
    #define REG_USBHS_HSTDMASTATUS3     ( *( __IO uint32_t * ) 0x4003873CU ) /**< \brief (USBHS) Host DMA Channel Status Register (n = 3) */
    #define REG_USBHS_HSTDMANXTDSC4     ( *( __IO uint32_t * ) 0x40038740U ) /**< \brief (USBHS) Host DMA Channel Next Descriptor Address Register (n = 4) */
    #define REG_USBHS_HSTDMAADDRESS4    ( *( __IO uint32_t * ) 0x40038744U ) /**< \brief (USBHS) Host DMA Channel Address Register (n = 4) */
    #define REG_USBHS_HSTDMACONTROL4    ( *( __IO uint32_t * ) 0x40038748U ) /**< \brief (USBHS) Host DMA Channel Control Register (n = 4) */
    #define REG_USBHS_HSTDMASTATUS4     ( *( __IO uint32_t * ) 0x4003874CU ) /**< \brief (USBHS) Host DMA Channel Status Register (n = 4) */
    #define REG_USBHS_HSTDMANXTDSC5     ( *( __IO uint32_t * ) 0x40038750U ) /**< \brief (USBHS) Host DMA Channel Next Descriptor Address Register (n = 5) */
    #define REG_USBHS_HSTDMAADDRESS5    ( *( __IO uint32_t * ) 0x40038754U ) /**< \brief (USBHS) Host DMA Channel Address Register (n = 5) */
    #define REG_USBHS_HSTDMACONTROL5    ( *( __IO uint32_t * ) 0x40038758U ) /**< \brief (USBHS) Host DMA Channel Control Register (n = 5) */
    #define REG_USBHS_HSTDMASTATUS5     ( *( __IO uint32_t * ) 0x4003875CU ) /**< \brief (USBHS) Host DMA Channel Status Register (n = 5) */
    #define REG_USBHS_HSTDMANXTDSC6     ( *( __IO uint32_t * ) 0x40038760U ) /**< \brief (USBHS) Host DMA Channel Next Descriptor Address Register (n = 6) */
    #define REG_USBHS_HSTDMAADDRESS6    ( *( __IO uint32_t * ) 0x40038764U ) /**< \brief (USBHS) Host DMA Channel Address Register (n = 6) */
    #define REG_USBHS_HSTDMACONTROL6    ( *( __IO uint32_t * ) 0x40038768U ) /**< \brief (USBHS) Host DMA Channel Control Register (n = 6) */
    #define REG_USBHS_HSTDMASTATUS6     ( *( __IO uint32_t * ) 0x4003876CU ) /**< \brief (USBHS) Host DMA Channel Status Register (n = 6) */
    #define REG_USBHS_HSTDMANXTDSC7     ( *( __IO uint32_t * ) 0x40038770U ) /**< \brief (USBHS) Host DMA Channel Next Descriptor Address Register (n = 7) */
    #define REG_USBHS_HSTDMAADDRESS7    ( *( __IO uint32_t * ) 0x40038774U ) /**< \brief (USBHS) Host DMA Channel Address Register (n = 7) */
    #define REG_USBHS_HSTDMACONTROL7    ( *( __IO uint32_t * ) 0x40038778U ) /**< \brief (USBHS) Host DMA Channel Control Register (n = 7) */
    #define REG_USBHS_HSTDMASTATUS7     ( *( __IO uint32_t * ) 0x4003877CU ) /**< \brief (USBHS) Host DMA Channel Status Register (n = 7) */
    #define REG_USBHS_CTRL              ( *( __IO uint32_t * ) 0x40038800U ) /**< \brief (USBHS) General Control Register */
    #define REG_USBHS_SR                ( *( __I uint32_t * ) 0x40038804U )  /**< \brief (USBHS) General Status Register */
    #define REG_USBHS_SCR               ( *( __O uint32_t * ) 0x40038808U )  /**< \brief (USBHS) General Status Clear Register */
    #define REG_USBHS_SFR               ( *( __O uint32_t * ) 0x4003880CU )  /**< \brief (USBHS) General Status Set Register */
    #define REG_USBHS_TSTA1             ( *( __IO uint32_t * ) 0x40038810U ) /**< \brief (USBHS) General Test A1 Register */
    #define REG_USBHS_TSTA2             ( *( __IO uint32_t * ) 0x40038814U ) /**< \brief (USBHS) General Test A2 Register */
    #define REG_USBHS_VERSION           ( *( __I uint32_t * ) 0x40038818U )  /**< \brief (USBHS) General Version Register */
    #define REG_USBHS_FEATURES          ( *( __I uint32_t * ) 0x4003881CU )  /**< \brief (USBHS) General Features Register */
    #define REG_USBHS_ADDRSIZE          ( *( __I uint32_t * ) 0x40038820U )  /**< \brief (USBHS) General APB Address Size Register */
    #define REG_USBHS_IPNAME1           ( *( __I uint32_t * ) 0x40038824U )  /**< \brief (USBHS) General Name Register 1 */
    #define REG_USBHS_IPNAME2           ( *( __I uint32_t * ) 0x40038828U )  /**< \brief (USBHS) General Name Register 2 */
    #define REG_USBHS_FSM               ( *( __I uint32_t * ) 0x4003882CU )  /**< \brief (USBHS) General Finite State Machine Register */
#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#endif /* _SAM_USBHS_INSTANCE_ */
